app/views/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 22]]
---
<% @article.comments.each do |cmt| %>